AudioStreamingPlatform/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5x/TARGET_NRF53/objects.h
/*
 * Copyright (c) 2013 Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this list
 *      of conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form, except as embedded into a Nordic Semiconductor ASA
 *      integrated circuit in a product or a software update for such product, must reproduce
 *      the above copyright notice, this list of conditions and the following disclaimer in
 *      the documentation and/or other materials provided with the distribution.
 *
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of its contributors may be
 *      used to endorse or promote products derived from this software without specific prior
 *      written permission.
 *
 *   4. This software, with or without modification, must only be used with a
 *      Nordic Semiconductor ASA integrated circuit.
 *
 *   5. Any software provided in binary or object form under this license must not be reverse
 *      engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef MBED_OBJECTS_H
#define MBED_OBJECTS_H

#include "cmsis.h"
#include "PortNames.h"
#include "PeripheralNames.h"
#include "PinNames.h"
#if NRFX_SPIM_ENABLED && DEVICE_SPI
#include "nrfx_spim.h"
#elif DEVICE_SPI
#include "nrfx_spi.h"
#endif
#include "nrfx_twim.h"
#if DEVICE_I2CSLAVE
#include "nrfx_twis.h"
#endif

#include "nrf_pwm.h"

#ifdef __cplusplus
extern "C" {
#endif

#include "nrfx_uarte.h"

#if MBED_CONF_CRYPTOCELL310_PRESENT
#include "objects_cryptocell.h"
#else
struct trng_s {
    uint32_t placeholder;
};
#endif

struct serial_s {
    nrfx_uarte_t instance;
    nrfx_uarte_config_t config;
    uint8_t rx_buffer_primary[1];
    uint8_t rx_buffer_secondary[1];
    volatile bool rx_buffer_primary_set;
    volatile bool rx_buffer_secondary_set;
    bool rx_buffer_secondary_in_use;
    volatile bool rx_irq_enable;
    volatile bool tx_irq_enable;
};

struct spi_s {
    int instance;
    PinName cs;
#if NRFX_SPIM_ENABLED && DEVICE_SPI
    nrfx_spim_config_t config;
#elif DEVICE_SPI
    nrfx_spi_config_t config;
#endif
    bool update;

#if DEVICE_SPI_ASYNCH
    uint32_t handler;
    uint32_t mask;
    uint32_t event;
#endif
};

struct port_s {
    PortName port;
    uint32_t mask;
};

struct pwmout_s {
    int instance;
    PinName pin;
    nrf_pwm_values_common_t pulse;
    uint16_t period;
    float percent;
    nrf_pwm_sequence_t sequence;
};

#if DEVICE_I2CSLAVE
typedef struct {
    nrfx_twis_evt_type_t event;
    union {
        nrfx_twis_error_t twis;
        nrfx_err_t nrfx;
    } code;
} i2c_slave_error;

typedef void (*i2c_slave_req_buf_cb_t)(void *, uint8_t **, size_t *);
typedef void (*i2c_slave_xfer_done_cb_t)(void *, size_t);
typedef void (*i2c_slave_error_cb_t)(void *, i2c_slave_error);

typedef struct {
    void *context;
    i2c_slave_req_buf_cb_t rxbuf_req;
    i2c_slave_req_buf_cb_t txbuf_req;
    i2c_slave_xfer_done_cb_t rx_done;
    i2c_slave_xfer_done_cb_t tx_done;
    i2c_slave_error_cb_t error;
} i2c_slave_callbacks;
#endif // DEVICE_I2CSLAVE

struct i2c_s {
    nrfx_twim_t instance;
    nrfx_twim_config_t config;
    int transfer_result;
    volatile bool transfer_complete;
    int address;
    char buffer[256];
    uint16_t length;

#if DEVICE_I2CSLAVE
    bool is_slave;
    uint8_t slave_addr;
    nrfx_twis_t slave_instance;
    i2c_slave_callbacks slave_callbacks;
#endif // DEVICE_I2CSLAVE
};

struct analogin_s {
    uint8_t channel_index;
};

struct gpio_irq_s {
    uint32_t ch;
};

struct flash_s {
    uint32_t placeholder;
};

#if DEVICE_QSPI

#include "nrfx_qspi.h"

struct qspi_s {
    uint32_t placeholder;
    //nrfx_qspi_config_t config;
};

#endif

#include "gpio_object.h"

#ifdef __cplusplus
}
#endif

#endif
